#    ____      ____                                                _
#   / ___|    |  _ \ _ __ ___   __ _ _ __ __ _ _ __ ___  _ __ ___ (_)_ __   __ _
#  | |   _____| |_) | '__/ _ \ / _` | '__/ _` | '_ ` _ \| '_ ` _ \| | '_ \ / _` |
#  | |__|_____|  __/| | | (_) | (_| | | | (_| | | | | | | | | | | | | | | | (_| |
#   \____|    |_|   |_|  \___/ \__, |_|  \__,_|_| |_| |_|_| |_| |_|_|_| |_|\__, |
#                              |___/                                       |___/

#+TITLE: Technical Aptitude Workshop (C-Language)
#+AUTHOR: Prof. T. R. Mahore
#+SUBTITLE: 3 Days Session on C Language (01 March 2021 to 03 March 2021)

*** Q.3. What do you mean by **Scope** of the Variable?
Scope of the variable can be defined as the part of the code area where the variables declared in the program can be accessed directly. In C, all identifiers are lexically (or statically) scoped.

#+begin_src cpp :exports both

#include<stdio.h>

// function prototype, also called function decleration
float square(float x);
// main function, program starts from here

int main() {
  float m = 10,n;
  // function call
  n = square(m);
  printf("Square of the given number %f is %f",m,n);
  return 0;
}

// function defination
float square(float x) {
  float p;
  p = x * x;
  return p;
}
#+end_src

#+RESULTS:
: Square of the given number 10.000000 is 100.000000

*** Q.4. What are **Static** **Variables** and **Functions**?
Static variables and static functions are almost the same variables and functions that we use in the C Programming Language. But the only difference is that we declare these variables and functions along with the 'static' keyword. The syntax of the declearation of static variable and function is as follows :

#+begin_example
static data_type var_name = var_value;
Eg: static int x = 10;
#+end_example

#+begin_src cpp :exports both
#include<stdio.h>

int fun() {
  static int count = 0;
  count++;
  return count;
}

int main() {
  printf("%d ",fun());
  printf(" %d",fun());
  return 0;
}
#+end_src

#+RESULTS:
: 1  2


*** Q.6. Where can we apply **break** control statement?
Break is the control statement which tells the compiler to break the execution of the program at that particular point. Break Control Statement is valid to be used inside loop and Switch Control Statements.

#+begin_src cpp :exports both
#include<stdio.h>

int main() {
  char opt;
  float x,y;

  //printf("Enter an Operator");
  //scanf("%c",opt)
  //printf("\nEnter two operands");
  //scanf("%ld %ld",x,y)

  opt = '+';
  x = 10, y = 20;

  switch(opt) {
  case '+':
    printf("%.1lf + %.1lf = %.1lf",x,y,x+y);
    break;
  case '-':
    printf("%.1lf + %.1lf = %.1lf",x,y,x-y);
    break;
  case '*':
    printf("%.1lf + %.1lf = %.1lf",x,y,x*y);
    break;
  case '/':
    printf("%.1lf + %.1lf = %.1lf",x,y,x/y);
    break;
    //operator doesn't match any case constant +,-,*,/
  default:
    printf("Error Operator is not Correct");
  }
  return 0;
}
#+end_src

#+RESULTS:
: 10.0 + 20.0 = 30.0

*** Q.10. What is a **Nested Structure**?
When a data member of one structure is reffered by the data member of another function, then the structure is called **Nested Structure**.

#+begin_src cpp :exports both
#include<stdio.h>

struct address {
  int city;
  int pin;
  int phone;
};

struct employee {
  int name;
  struct address add;
};

int main() {
  struct employee emp;
  //printf("Enter Employee Information\n");
  //scanf("%s %s %d %s",emp.name,emp.add.city, &emp.add.pin, emp.add.phone);
  emp.name = 123;
  emp.add.city = 456;
  emp.add.pin = 789;
  emp.add.phone = 000;

  printf("Name: %d City: %d Pincode: %d Phone: %d",emp.name,emp.add.city,emp.add.pin,emp.add.phone);
  return 0;
}
#+end_src

#+RESULTS:
: Name: 123 City: 456 Pincode: 789 Phone: 0

*** Q.16. What is an **Array**?
Array is a datastructure which stores similar kind of values in a sequential order. There are mainly three types of arrays one dimensional array, two dimensional array and multi dimensional array.

#+begin_src cpp : exports both
#include<stdio.h>

int main() {
  int i = 0;
  int id[4];
  id[0] = 1001;
  id[1] = 1002;
  id[2] = 1003;
  id[3] = 1004;
  for(i=0;i<4;i++) {
    printf("%d ",id[i]);
  }
  return 0;
}
#+end_src

#+RESULTS:
: 1001 1002 1003 1004

*** Q.17. What is **\0** character?
The symbol mentioned is called **Null Character**. It is considered as the terminating charcter used in strings to notify the end of the string to the compiler.

#+begin_src cpp :exports both
#include<stdio.h>
#include<string.h>
int main() {
  int length;
  char ch[20] = {'B','A','T','M','A','N','\0'};
  printf("Length of a String is: %d",strlen(ch));
  return 0;
}
#+end_src

#+RESULTS:
: Length of a String is: 6

*** Q.2. What is **Dynamic Memory Allocation**? Mention it's syntax?
Dynamic memory allocation is the method which is used to allocate memory to the program in **Run Time**.

#+begin_example
ptr = (cast_type*)malloc(bytesize);
ptr = (cast_type)calloc(n,element-size);
ptr = realloc(ptr,newsize);
free(ptr)
#+end_example

#+begin_src cpp :exports both
#include<stdio.h>
#include<stdlib.h>

int main() {
  int *ptr;
  int n, i, sum = 0;
  n = 5;
  //printf("Enter No. of Elements: %d\n",n)
  n = 10;
  ptr = ((int*)malloc(n * sizeof(int)));
  if(ptr == NULL) {
    printf("Memory not Allocated");
    exit(0);
  }
  else {
    printf("Memory Successfully Allocated using malloc ");
    for(i = 0; i < n; i++) {
      ptr[i] = i + 1;
    }
    printf("The elements of array are: ");
    for(i = 0; i < n; i++) {
      printf("%d, ",ptr[i]);
    } }
  return 0;
}
#+end_src

#+RESULTS:
| Memory Successfully Allocated using malloc The elements of array are: 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |   |

*** Q.5. Difference between **CallByValue** and **CallByReference**?

|-----------------+-----------------------------------------------------------------------+--------------------------------------------------------------|
| Factor          | Call by Value                                                         | Call by Reference                                            |
|-----------------+-----------------------------------------------------------------------+--------------------------------------------------------------|
| Saftey          | Actual arguments cannot be changed and remain safe                    | Operations are performed on actual arguments, hence not safe |
| Memory Location | Seperate memory locations are created for Actual and Formal arguments | Actual and Formal arguments share the same memory            |
| Arguments       | Copy of actual arguments are sent                                     | Actual arguments are passed                                  |

**Example:** Call By Value
#+begin_src cpp :exports both
#include<stdio.h>
int change(int num) {
  num = num + 100;
  printf("Inside Function Number %d ",num);
  return 0;
}

int main() {
  int x = 100;
  printf("Before Function Call ");
  change(x);
  printf("After Function Call");
  return 0;
}
#+end_src

#+RESULTS:
: Before Function Call Inside Function Number 200 After Function Call

**Example:** Call by Reference
#+begin_src cpp :exports both
#include<stdio.h>

int swap(int, int);

int main() {
  int a = 10;
  int b = 20;
  printf("Before swapping the values in main a = %d, b = %d ",a,b);
  swap(a,b);
  printf("After swapping values in main a = %d, b = %d",a,b);
  return 0;
}

int swap(int a, int b) {
  int temp;
  temp = a;
  a = b;
  b = temp;
  printf("After Swapping a = %d & b = %d",a,b);
}
#+end_src

#+RESULTS:
| Before swapping the values in main a = 10 | b = 20 After Swapping a = 20 & b = 10After swapping values in main a = 10 | b = 20 |

*** Q.7. Explain **toupper()** with an example
**toupper()** is a string function designed to convert lowercase words/characters into upper case.

#+begin_src cpp :exports both
#include<stdio.h>
#include<string.h>
#include<ctype.h>

int main() {
  char str[20] = "batman";
  int i = 0;
  //printf("Enter the String");
  //gets(str);
  printf("String is %s ",str);
  // printf("Upper Case String is %s",strupr(str));
  while(str[i]) {
    putchar (toupper(str[i]));
    i++;
  }
  return 0;
}
#+end_src

#+RESULTS:
: String is batman BATMAN

*** Q.8. Write a simple code to generate **Random Numbers** in C

**Example Code:**
#+begin_src cpp :exports both
#include<stdio.h>
#include<stdlib.h>

int main() {
  int c, n;
  printf("Ten Random Numbers in [1-100] ");

  for(c=1;c<=10;c++) {
    n = rand() % 100 + 1;
    printf("%d ",n);
  }
  return 0;
}
#+end_src

#+RESULTS:
: Ten Random Numbers in [1-100] 8 50 74 59 31 73 45 79 24 10

*** Q.21. Swap two numbers without using a third variable
**Example Code:**
#+begin_src cpp :exports both
#include<stdio.h>
#include<stdlib.h>

int main() {
  int a = 10, b = 20;
  printf("Before Swap a=%d, b=%d ",a,b);
  a=a*b;
  b=a/b;
  a=a/b;
  printf("After Swap a=%d, b=%d",a,b);
  return 0;
}
#+end_src

#+RESULTS:
| Before Swap a=10 | b=20 After Swap a=20 | b=10 |

*** Q.2. Write the code to print the following pattern:
1
12
123
1234
12345

**Example Code:**
#+begin_src cpp :exports both
#include<stdio.h>

int main() {
  int i,j,rows;
  //printf("Enter the Number of Rows: ");
  //scanf("%d",&rows)
  rows = 5;
  for(i=0;i<=rows;i++) {
    for(j=1;j<=i;j++) {
      printf("%d",j);
    }
    printf("\n");
  }
}
#+end_src

#+RESULTS:
|       |
|     1 |
|    12 |
|   123 |
|  1234 |
| 12345 |

*** Q.4. How to remove **duplicates** in array?
**Example Code:**
#+begin_src cpp :exports both
#include<stdio.h>

int main()
{
  int arr[10] = {1,1,2,3,4}, i, j, k, Size;

  //printf("\n Please Enter Number of elements in an array  :   ");
  //scanf("%d", &Size);

  Size = 5;

  /*printf("\n Please Enter %d elements of an Array \n", Size);
    for (i = 0; i < Size; i++) {
    scanf("%d", &arr[i]);
    } */

  for (i = 0; i < Size; i++) {
    for(j = i + 1; j < Size; j++) {
      if(arr[i] == arr[j]) {
        for(k = j; k < Size; k++) {
          arr[k] = arr[k + 1];
        }
        Size--;
        j--;
      }
    }
  }

  printf("Final Array after Deleteing Duplicate Array Elements is: ");
  for (i = 0; i < Size; i++) {
    printf("%d\t", arr[i]);
  }
  return 0;
}
#+end_src

#+RESULTS:
| Final Array after Deleteing Duplicate Array Elements is: 1 | 2 | 3 | 4 |

*** Q.1.

#+begin_src cpp
#include<stdio.h>

#define x 5+2 //Macros will not execute or Macros are going to rplace

int main() {
  int i;
  i = x*x*x; //5+2*5+2*5+2
  printf("i is %d",i);
  return 0;
}
#+end_src

#+RESULTS:
: i is 27

a. 343
b. 27
c. compiler error
d. 21

*** Q.2.

#+begin_src cpp
#include<stdio.h>

int main() {
  int n = 65;

  switch(n) {
  case 64:
    printf("Case 64");
    break;
  case 'A':
    printf("Case A");
    break;
  default:
    printf("Default Case");
  }
  return 0;
}
#+end_src

#+RESULTS:
: Case A

a. Case 64
b. Case A
c. Default Case
d. Compiler Error: Incompatible datatypes in case lable and switch expression

*** Q.5.

#+begin_src cpp
#include<stdio.h>

int main() {
  int i = 1;
  i++;
  switch(i--) {
  case 1:
    printf("Case 1 is Executed");
    break;
  case 2:
    printf("Case 2 is Executed");
    break;
  default:
    printf("Default Block is Executed");
  }
  return 0;
}
#+end_src

#+RESULTS:
: Case 2 is Executed

a. Case 2 is Executed
b. Case 1 is Executed
c. Default Block is Executed
d. Compilation Error

*** Q.12.

#+begin_src cpp
#include<stdio.h>

int main() {
  int k=30;
  printf("%d %d %d",k<=30,k=40,k==30);
  return 0;
}
#+end_src

#+RESULTS:
: 1 40 0

a. 1 40 0
b. Compilation Error
c. 0 40 1
d. Run Time Error

*** Q.16.

#+begin_src cpp
#include<stdio.h>

int main() {
  int i=1;
  for(printf("Hi ");i<=3;i++) {
    printf("Hello Batman No. %d ",i);
  }
  return 0;
}
#+end_src

#+RESULTS:
: Hi Hello Batman No. 1 Hello Batman No. 2 Hello Batman No. 3

**Write Down the Output**

*** Q.17.

#+begin_src cpp
#include<stdio.h>

int main() {
  int i=1;
  for(printf("Hi ");i<=3;printf("Hello ")) {
    i++;
  }
  return 0;
}
#+end_src

#+RESULTS:
: Hi Hello Hello Hello

**Write Down the Output**

*** Q.18.

#+begin_src cpp
#include<stdio.h>

int main() {
  int i=0;
  for(printf("Hi ");i<printf("ok")/*i<2*/;printf("Bye ")) {
    printf("No. %d ",i);
    i++;
  }
  return 0;
}
#+end_src

#+RESULTS:
: Hi okNo. 0 Bye okNo. 1 Bye ok

**Write Down the output**

*** Q.21.

#+begin_src cpp
#include<stdio.h>

int main() {
  int i;
  for(i=0;i<=5;i++); {
    printf("Hi %d ",i);
  }
  return 0;
}
#+end_src

#+RESULTS:
: Hi 6

**Write Down the Output**

*** Q.31.

#+begin_src cpp
#include<stdio.h>

int main() {
  int a,x;
  a = 5, x = a++;
  printf("%d %d ",x,a);

  a = 5, x = ++a;
  printf("%d %d ",x,a);

  a = 5, x = a--;
  printf("%d %d ",x,a);

  a = 5, x = --a;
  printf("%d %d ",x,a);

  return 0;
}
#+end_src

#+RESULTS:
: 5 6 6 6 5 4 4 4

**Write Down the output**

*** Q.32.

#+begin_src cpp
#include<stdio.h>

int main() {
  int a = 6;
  printf("%d ",a--);
  printf("%d ",++a);
  printf("%d ",a++);
  return 0;
}
#+end_src

#+RESULTS:
: 6 6 6

**Write Down the output**

*** Q.39.

#+begin_src cpp
#include<stdio.h>

void f(int *p,int *q) {
  p=q;
  ,*p=2;
}

int i=0,j=1;

int main() {
  f(&i,&j);
  printf("%d %d",i,j);
  return 0;
}
#+end_src

#+RESULTS:
: 0 2

**Write Down the Output**

